NextFOAM-2509/tutorials/incompressible/lumpedPointMotion/bridge/steady/system/lumpedPointControllers
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "locations and connectivity";
    object      dictionary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- Connectivity for motion controllers
controllers
{
    girderA
    {
        pointLabels
        (
            1100 1110 1120 1130 1140 1150 1160 1170 1180 1190
            1200
            1210 1220 1230 1240 1250 1260 1270 1280 1290 1300
        );
    }

    girderB
    {
        pointLabels
        (
            2100 2110 2120 2130 2140 2150 2160 2170 2180 2190
            2200
            2210 2220 2230 2240 2250 2260 2270 2280 2290 2300
        );
    }
    girderCross1
    {
        pointLabels
        (
            1110
            3101 3102 3103
            2110
        );
    }

    girderCross2
    {
        pointLabels
        (
            1150
            3201 3202 3203
            2150
        );
    }

    girderCross3
    {
        pointLabels
        (
            1190
            3301 3302 3303
            2190
        );
    }

    girderCross4
    {
        pointLabels
        (
            1210
            3401 3402 3403
            2210
        );
    }

    girderCross5
    {
        pointLabels
        (
            1250
            3501 3502 3503
            2250
        );
    }

    girderCross6
    {
        pointLabels
        (
            1290
            3601 3602 3603
            2290
        );
    }

    tower
    {
        pointLabels
        (
            5100
            5110
            5120
            5130
            5140
            5150
            // can ignore this one? 5160
            5170
            5180
            5190
            5200
            5210
            5220
            5230
            5240
            5250
        );
    }

    support
    {
        pointLabels
        (
            5310 5320
            5150  // tie to tower
            5410 5420
        );
    }
}


//- Locations of the lumped points
points
80
(
     (  15.3125   -250.000   68.5906 )  //1100
     (  15.3125   -242.500   68.5906 )  //1110
     (  15.3125   -216.250   68.5906 )  //1120
     (  15.3125   -190.000   68.5906 )  //1130
     (  15.3125   -163.750   68.5906 )  //1140
     (  15.3125   -137.500   68.5906 )  //1150
     (  15.3125   -107.500   68.5906 )  //1160
     (  15.3125    -77.500   68.5906 )  //1170
     (  15.3125    -47.500   68.5906 )  //1180
     (  15.3125    -17.500   68.5906 )  //1190
     (  15.3125      0.0     68.5906 )  //1200
     (  15.3125     17.500   68.5906 )  //1210
     (  15.3125     47.500   68.5906 )  //1220
     (  15.3125     77.500   68.5906 )  //1230
     (  15.3125    107.500   68.5906 )  //1240
     (  15.3125    137.500   68.5906 )  //1250
     (  15.3125    163.750   68.5906 )  //1260
     (  15.3125    190.000   68.5906 )  //1270
     (  15.3125    216.250   68.5906 )  //1280
     (  15.3125    242.500   68.5906 )  //1290
     (  15.3125    250.000   68.5906 )  //1300
     ( -15.3125   -250.000   68.5906 )  //2100
     ( -15.3125   -242.500   68.5906 )  //2110
     ( -15.3125   -216.250   68.5906 )  //2120
     ( -15.3125   -190.000   68.5906 )  //2130
     ( -15.3125   -163.750   68.5906 )  //2140
     ( -15.3125   -137.500   68.5906 )  //2150
     ( -15.3125   -107.500   68.5906 )  //2160
     ( -15.3125    -77.500   68.5906 )  //2170
     ( -15.3125    -47.500   68.5906 )  //2180
     ( -15.3125    -17.500   68.5906 )  //2190
     ( -15.3125      0.0     68.5906 )  //2200
     ( -15.3125     17.500   68.5906 )  //2210
     ( -15.3125     47.500   68.5906 )  //2220
     ( -15.3125     77.500   68.5906 )  //2230
     ( -15.3125    107.500   68.5906 )  //2240
     ( -15.3125    137.500   68.5906 )  //2250
     ( -15.3125    163.750   68.5906 )  //2260
     ( -15.3125    190.000   68.5906 )  //2270
     ( -15.3125    216.250   68.5906 )  //2280
     ( -15.3125    242.500   68.5906 )  //2290
     ( -15.3125    250.000   68.5906 )  //2300
     (   7.65625  -242.500   68.5906 )  //3101
     (   7.65625  -137.500   68.5906 )  //3201
     (   7.65625  -17.5000   68.5906 )  //3301
     (   7.65625   17.5000   68.5906 )  //3401
     (   7.65625   137.500   68.5906 )  //3501
     (   7.65625   242.500   68.5906 )  //3601
     (   0.0      -242.500   68.5906 )  //3102
     (   0.0      -137.500   68.5906 )  //3202
     (   0.0      -17.5000   68.5906 )  //3302
     (   0.0       17.5000   68.5906 )  //3402
     (   0.0       137.500   68.5906 )  //3502
     (   0.0       242.500   68.5906 )  //3602
     (  -7.65625  -242.500   68.5906 )  //3103
     (  -7.65625  -137.500   68.5906 )  //3203
     (  -7.65625   -17.500   68.5906 )  //3303
     (  -7.65625    17.500   68.5906 )  //3403
     (  -7.65625   137.500   68.5906 )  //3503
     (  -7.65625   242.500   68.5906 )  //3603
     (   0.0         0.0      5.0    )  //5100
     (   0.0         0.0     18.250  )  //5110
     (   0.0         0.0     31.500  )  //5120
     (   0.0         0.0     44.750  )  //5130
     (   0.0         0.0     58.000  )  //5140
     (   0.0         0.0     64.750  )  //5150
     (   0.0         0.0     66.000  )  //5160
     (   0.0         0.0     88.875  )  //5170
     (   0.0         0.0    111.750  )  //5180
     (   0.0         0.0    134.625  )  //5190
     (   0.0         0.0    157.500  )  //5200
     (   0.0         0.0    166.250  )  //5210
     (   0.0         0.0    175.000  )  //5220
     (   0.0         0.0    185.000  )  //5230
     (   0.0         0.0    195.000  )  //5240
     (   0.0         0.0    200.000  )  //5250
     (  15.3125      0.0     64.750  )  //5310
     (  21.525       0.0     64.750  )  //5320
     ( -15.3125      0.0     64.750  )  //5410
     ( -21.525       0.0     64.750  )  //5420
);


//- Original (FEA) labels in order of appearance
pointLabels
(
1100 1110 1120 1130 1140 1150 1160 1170 1180 1190
1200
1210 1220 1230 1240 1250 1260 1270 1280 1290 1300

2100 2110 2120 2130 2140 2150 2160 2170 2180 2190
2200
2210 2220 2230 2240 2250 2260 2270 2280 2290 2300

3101 3201 3301 3401 3501 3601
3102 3202 3302 3402 3502 3602
3103 3203 3303 3403 3503 3603

5100 5110 5120 5130 5140 5150
5160
5170 5180 5190 5200 5210 5220 5230 5240 5250

5310 5320 5410 5420
);


// ************************************************************************* //
